<?php 

 /**
 *  Instance of translit converter
 */
 class TranslitConverter
 {
 	private $replace = array(
	"А"=>"A","а"=>"a",
	"Б"=>"B","б"=>"b",
	"В"=>"V","в"=>"v",	
	"Г"=>"G","г"=>"g",
	"Ґ"=>"G","ґ"=>"g",
	"Д"=>"D","д"=>"d",
	"Е"=>"E","е"=>"e",
	"Є"=>"Je","є"=>"je",
	"Ж"=>"Zh","ж"=>"zh",
	"З"=>"Z","з"=>"z",
	"И"=>"U","и"=>"u",
	"І"=>"i","і"=>"i",
	"Ї"=>"Yi","ї"=>"yi",
	"Й"=>"J","й"=>"j",
	"К"=>"K","к"=>"k",
	"Л"=>"L","л"=>"l",
	"М"=>"M","м"=>"m",
	"Н"=>"N","н"=>"n",
	"О"=>"O","о"=>"o",
	"П"=>"P","п"=>"p",
	"Р"=>"R","р"=>"r",
	"С"=>"S","с"=>"s",
	"Т"=>"T","т"=>"t",
	"У"=>"Y","у"=>"y",
	"Ф"=>"F","ф"=>"f",
	"Х"=>"Kh","х"=>"kh",
	"Ц"=>"Ts","ц"=>"ts",
	"Ч"=>"Ch","ч"=>"ch",
	"Ш"=>"Sh","ш"=>"sh",
	"Щ"=>"Shch","щ"=>"shch",
	"Ю"=>"Yu","ю"=>"yu",
	"Я"=>"Ja","я"=>"ja",
	"Ь"=>"","ь"=>"");

	public funtion toTranslit($string)
	{
		return iconv("UTF-8","UTF-8//IGNORE",strtr($string,$replace));
	}
 }